In [33]:
# Practice Question on Group by 
# Resources : https://www.udemy.com/course/python-pandas/learn/lecture/33233708#overview

In [34]:
import pandas as pd

In [3]:
Transaction  = pd.read_csv('D:\\karan data\\Data for Preprocessing\\retail\\transactions.csv')

In [8]:
Transaction.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          83488 non-null  object
 1   store_nbr     83488 non-null  int64
 2   transactions  83488 non-null  int64
dtypes: int64(2), object(1)
memory usage: 1.9+ MB

In [10]:
Transaction.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          83488 non-null  datetime64[ns]
 1   store_nbr     83488 non-null  int64
 2   transactions  83488 non-null  int64
dtypes: datetime64[ns](1), int64(2)
memory usage: 1.9 MB

In [9]:
Transaction['date'] = pd.to_datetime(Transaction['date'])

In [11]:
Transaction['Month'] = Transaction['date'].dt.month

In [12]:
Transaction.head(3)

        date  store_nbr  transactions  Month
0 2013-01-01         25           770      1
1 2013-01-02          1          2111      1
2 2013-01-02          2          2358      1

In [23]:
Transaction.groupby(['store_nbr', 'Month'])[['transactions']].sum().sort_values(by = ['Month', 'transactions'], ascending=[True, False])

                 transactions
store_nbr Month
44        1            628438
47        1            568824
45        1            538370
46        1            522763
3         1            463260
...                       ...
32        12            86167
21        12            84128
42        12            76741
29        12            76627
22        12            50650

[641 rows x 1 columns]

In [35]:
Transaction.groupby(['store_nbr', 'Month'])\
.agg(sum = ('transactions', 'sum'), mean = ('transactions', 'mean'))\
.sort_values(by = ['Month', 'sum', 'mean'], ascending = [True, False, False])\
.iloc[:5]

                    sum         mean
store_nbr Month
44        1      628438  4246.202703
47        1      568824  3843.405405
45        1      538370  3637.635135
46        1      522763  3532.182432
3         1      463260  3151.428571